[
  "Hey there! I'm Kenny, a Computer Engineering graduate turned Software Engineer with experience in both backend and frontend development. Over the years, I've worked as a Computer Programmer, Software Developer, and Software Engineer, building scalable and efficient applications. I specialize in crafting backend systems while also developing dynamic frontend experiences.",
  "I've had the opportunity to develop software across a variety of settings, from universities to startups and large corporations. Whether it's designing APIs, optimizing database queries, or fine-tuning frontend interactions, I love tackling technical challenges and writing clean, efficient code.",
  "I have experience working across the full stack, developing both backend and frontend applications. For backend development, I primarily use Go with Echo or Ruby on Rails to build scalable and efficient systems. On the frontend, I work with JavaScript and ReactJS to create dynamic and responsive user interfaces. I am familiar with PostgreSQL and MongoDB for database management, ensuring data is well-structured and optimized for performance. I have also worked with Docker for containerization and deployment. During my college years, I gained hands-on experience with embedded systems, working with Arduino and Raspberry Pi. Additionally, I have a background in C and C++ from my academic projects, which strengthened my understanding of low-level programming and system design.",
  "Outside of software development, I have a strong passion for art and design. I specialize in creating graphite pencil portraits, capturing intricate details and expressions through shading and precision. In addition to traditional art, I have experience in graphic design, working on t-shirt designs and business logos for various clients. Lately, I've been exploring digital art, experimenting with different styles and techniques to expand my creative skill set. Whether it's working with pencil, vector graphics, or digital tools, I enjoy bringing ideas to life through visual storytelling and design."
]
